run/porousPimpleFoam/cylinder_1d/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-8.862269e-02 -8.862269e-02 0.000000e+00) // 0
    (8.862269e-02 -8.862269e-02 0.000000e+00) // 1
    (8.862269e-02 8.862269e-02 0.000000e+00) // 2
    (-8.862269e-02 8.862269e-02 0.000000e+00) // 3
    (-8.862269e-02 -8.862269e-02 5.000000e-01) // 4
    (8.862269e-02 -8.862269e-02 5.000000e-01) // 5
    (8.862269e-02 8.862269e-02 5.000000e-01) // 6
    (-8.862269e-02 8.862269e-02 5.000000e-01) // 7
);

blocks
(
hex (0 1 2 3 4 5 6 7) porosity (1 1 50)  simpleGrading (1 1 1)
);

edges
(
);

boundary
(
   bottom
   {
       type patch;
       faces
       (
       (0 3 2 1)
       );
   }
   walls
   {
      type wall;
      faces
      (
      (4 7 3 0)
      (3 7 6 2)
      (1 2 6 5)
      (0 1 5 4)
      );
   }
   top
   {
      type patch;
      faces
      (
      (7 4 5 6)
      );
   }
);

mergePatchPairs
(
);

